#+TITLE: Macrology
#+DATE: <2015-12-03 Thu>
#+AUTHOR: Brian Beckman
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not LOGBOOK) date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+SELECT_TAGS: export
#+LaTeX_CLASS_OPTIONS: [10pt,oneside,x11names]
#+LaTeX_HEADER: \usepackage{geometry}
#+LaTeX_HEADER: \usepackage{palatino}
#+LaTeX_HEADER: \usepackage{siunitx}
#+LaTeX_HEADER: \usepackage{braket}
#+LaTeX_HEADER: \usepackage[euler-digits,euler-hat-accent]{eulervm}
#+OPTIONS: toc:2

* Version information

  This is version 0.0.1 of the text. The following are reports of versions of
  Emacs, Org-Mode, and SBL.

  #+BEGIN_SRC emacs-lisp :results output :exports results :tangle no
    (princ (concat (format "Emacs version: %s\n" (emacs-version))
                   (format "org version: %s\n" (org-version))))
    (setq org-confirm-babel-evaluate nil)
    (org-babel-map-src-blocks nil (org-babel-remove-result))
  #+END_SRC

  #+RESULTS:
  : Emacs version: GNU Emacs 24.5.1 (x86_64-apple-darwin13.4.0, NS apple-appkit-1265.21)
  :  of 2015-04-10 on builder10-9.porkrind.org
  : org version: 8.3.1

#+BEGIN_SRC lisp :exports results
    (concatenate 'string "SBCL version: " (lisp-implementation-version))
#+END_SRC

#+RESULTS:
: SBCL version: 1.3.1

**** TODO Exclude empty strings?

#+BEGIN_SRC lisp :tangle no
  (length (mkstr))
#+END_SRC

#+RESULTS:
: 0

#+BEGIN_SRC lisp :tangle no
  (stringp (mkstr))
#+END_SRC

#+RESULTS:
: T

#+BEGIN_SRC lisp :tangle no
  (length "foo42")
#+END_SRC

#+RESULTS:
: 5

#+BEGIN_SRC lisp :tangle no
  (= 10 (length (mkstr "foo42" "bar42")))
#+END_SRC

#+RESULTS:
: T

#+BEGIN_SRC lisp :exports both :tangle no
  (symb "foo42" "bar42")
#+END_SRC

#+RESULTS:
: |foo42bar42|

#+BEGIN_SRC lisp :exports both :tangle no
  (symb "foo42" "bar42")
#+END_SRC

A symbol from an empty string works, but it's weird.  Should we exclude this
case?

**** TODO Exclude symbols of zero length?

#+BEGIN_SRC lisp :exports both :tangle no
  (symb "")
#+END_SRC

#+RESULTS:
: ||

#+BEGIN_SRC lisp :exports both :tangle no
  (symbol-name (symb ""))
#+END_SRC

#+RESULTS:

*** Test

#+BEGIN_SRC lisp :exports both :tangle no
  (group '(1 2 3 4) 2)
#+END_SRC

#+RESULTS:
| 1 | 2 |
| 3 | 4 |

#+BEGIN_SRC lisp :exports both :tangle no
  (group '(1 2 3 4) 3)
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |
| 4 |   |   |

#+BEGIN_SRC lisp :exports both :tangle no
  (group '(1 (2 3) 4) 2)
#+END_SRC

#+RESULTS:
| 1 | (2 3) |
| 4 |       |

#+BEGIN_SRC lisp :exports both :tangle no
  (group '(1 2 3 4) 1)
#+END_SRC

#+RESULTS:
| 1 |
| 2 |
| 3 |
| 4 |

*** Test

#+BEGIN_SRC lisp :exports both :tangle no
  (flatten '())
#+END_SRC

#+RESULTS:
: NIL

#+BEGIN_SRC lisp :exports both :tangle no
  (flatten '(1))
#+END_SRC

#+RESULTS:
| 1 |

#+BEGIN_SRC lisp :exports both :tangle no
  (flatten '(1 (2 3) 4))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 |

#+BEGIN_SRC lisp :exports both :tangle no
  (flatten '((3)))
#+END_SRC

#+RESULTS:
| 3 |

** Test

   This doesn't print well. See http://stackoverflow.com/questions/34079242/.

#+BEGIN_SRC lisp :exports both :tangle no :results values
  (defun nlet-fact (n)
    (nlet fact ((n n))
          (if (zerop n)
              1
              (* n (fact (- n 1))))))
  (nlet-fact 60)
#+END_SRC

#+RESULTS:
: 8.32098711274139e+81

   All bignums seems to print poorly.  Here are a couple of other attempts:

#+BEGIN_SRC lisp :exports both :tangle no :results values
  (defun fact (n)
    (if (= 0 n)
        1
        (* n (fact (- n 1)))))
  (fact 60)
#+END_SRC

#+RESULTS:
: 8.32098711274139e+81

#+BEGIN_SRC lisp :exports both :tangle no :results values
  (defun range (max &key (min 0) (step 1))
    (loop for n from min below max by step
          collect n))
  (reduce #'* (range 61 :min 1))
#+END_SRC

#+RESULTS:
: 8.32098711274139e+81

#+BEGIN_SRC lisp
  (setf *print-pretty* nil)
#+END_SRC

#+RESULTS:
: NIL

#+BEGIN_SRC lisp :exports both :tangle no :results values
  (reduce #'* (range 61 :min 1))
#+END_SRC

#+RESULTS:
: 8.32098711274139e+81
** G-BANG-SYMBOL-PREDICATE (Listing 3.5)

#+BEGIN_SRC lisp :tangle yes
  (defun g!-symbol-p (s)
    (and (symbolp s)
         (> (length (symbol-name s)) 2)
         (string= (symbol-name s)
                  "G!"
                  :start1 0
                  :end1 2)))
#+END_SRC

#+RESULTS:
: G!-SYMBOL-P

** DEFMACRO-WITH-G-BANG (Listing 3.6)

#+BEGIN_SRC lisp :tangle yes
  (defmacro defmacro/g! (name args &rest body)
    (let ((syms (remove-duplicates
                 (remove-if-not #'g!-symbol-p
                                (flatten body)))))
      `(defmacro ,name ,args
         (let ,(mapcar
                (lambda (s)
                  `(,s (gensym ,(subseq
                                 (symbol-name s)
                                 2))))
                syms)
           ,@body))))
#+END_SRC

#+RESULTS:
: DEFMACRO/G!
